Autodesk.Revit.UI.SubMenuItem.#ctor(System.String,Autodesk.Revit.UI.ContextMenu)
Initialize the item data.
name:
The name will show on menu.
subMenu:
The object of child ContextMenu.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.UI.SubMenuItem
A class representing a menu flyout.
Remarks:
To add a child menu, create a new Autodesk.Revit.UI.ContextMenu object and add MenuItem on it,
pass the child ContextMenu object to SubMenuItem constructor and create SubMenuItem object,
use AddItem() method to add the SubMenuItem object to parent ContextMenu.
Since:
2025